In [2]:
import pandas as pd
import numpy as np
from faker import Faker
fake = Faker()

#### Create from dictionary that contains lists

In [2]:
fname = ['Paul', 'John', 'Richard', 'George']
lname = ['McCartney', 'Lennon', 'Starkey', 'Harrison']
birth = [1942, 1940, 1940, 1943]
people = {'first': fname, 'last': lname, 'birth': birth}

beatles = pd.DataFrame(people)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

#### Create from list of dictionaries

In [3]:
list_of_dicts = [
    {
        'first': 'Paul',
        'last': 'McCartney',
        'birth': 1942,
    },
    {
        'first': 'John',
        'last': 'Lennon',
        'birth': 1940,
    },
    {
        'first': 'Richard',
        'last': 'Starkey',
        'birth': 1940,
    },
    {
        'first': 'George',
        'last': 'Harrison',
        'birth': 1943,
    }
]

beatles = pd.DataFrame(list_of_dicts)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

#### Create from multiple lists zipped

In [23]:
# create list of names and date of births
names = [fake.name() for i in range(10)]
dob = [fake.date_of_birth() for i in range(10)]

# create dataframe
pd.DataFrame(data=list(zip(names, dob)), columns=['name', 'dob'])

                 name         dob
0         Alec Morgan  1907-12-24
1     Holly Velasquez  1944-04-19
2        Melvin James  1925-09-25
3         Maria Jones  1988-11-13
4        Calvin Estes  1936-08-04
5       Tyler Sanchez  1999-03-24
6         Megan Clark  1910-07-17
7        Jesse Barron  1990-08-08
8       David Russell  1955-10-12
9  Anthony Hutchinson  1920-09-23

#### Create from a list of lists

In [24]:
lst_of_lst = [[fake.name(), fake.date_of_birth()] for i in range(10)]
pd.DataFrame(data=lst_of_lst, columns=['name', 'dob'])

               name         dob
0    Robert Stevens  1979-07-22
1      Emily Arnold  1933-06-02
2      Kaylee Smith  1913-06-13
3   Christy Spencer  1996-07-01
4      Anthony Rush  1921-05-16
5      Jennifer Lee  2008-05-02
6        Maria Tate  1957-02-23
7  Mrs. Lisa Mendez  2002-12-06
8      Adrian Glenn  2007-12-12
9       Chad Decker  1993-02-20

#### Create from multiple Excel sheets

In [ ]:
def open_multiple_sheets(path, sheets):
    li = []
    for sheet in sheets:
        df = pd.read_excel(path, sheet_name=sheet)
        li.append(df)
    return pd.concat(li, axis=0, ignore_index=True)

#### Create from multiple files

In [ ]:
files = ['file_1.csv', 'file_2.csv', 'file_3.csv']
df = pd.concat((pd.read_csv(file) for file in files), ignore_index=True)

#### Create series from list, dict, numpy array

In [4]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

# create series from list
ser1 = pd.Series(mylist)

# create series from numpy array
ser2 = pd.Series(myarr)

# create series from dict
ser3 = pd.Series(mydict)

print(ser1.head(), end='\n\n')
print(ser2.head(), end='\n\n')
print(ser3.head(), end='\n\n')

0    a
1    b
2    c
3    e
4    d
dtype: object

0    0
1    1
2    2
3    3
4    4
dtype: int32

a    0
b    1
c    2
e    3
d    4
dtype: int32

#### Assign a name to a series' index

In [5]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

# Solution
ser.name = 'alphabets'
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabets, dtype: object